Catalogs/Образцы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Образцы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Образцы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Картинки

&НаКлиенте
Перем МассивИменВременныхФайлов;
&НаКлиенте
Перем  ВсегоКартинок Экспорт;
&НаКлиенте
Перем НомерКартинки Экспорт;
&НаКлиенте
Перем НастройкиТекущейФормы Экспорт;

&НаКлиенте
Процедура ОбщаяКомандаКартинка(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки, , МассивИменВременныхФайлов); 
КонецПроцедуры 

&НаКлиенте
Процедура ОбщаяКомандаНастройкаКартинки(Команда)
	омКартинкиНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, НомерКартинки, ,МассивИменВременныхФайлов); 
КонецПроцедуры 

&НаКлиенте
Процедура ИнформацияОКартинках(ТекущийНомерКартинки = 0)

	ИмяСозданогоВременногоФайла = Новый Массив;
	ВсегоКартинок = омКартинкиНаСервере.ПолучитьИнформациюОКартинках(Объект.Ссылка, Истина);
	НомерКартинки = ТекущийНомерКартинки;

КонецПроцедуры // ИнформацияОКартинках()

//
&НаКлиенте
Процедура ВывестиКартинку()

	ИнформацияОКартинках();
	Если ВсегоКартинок = 0 Тогда
		Элементы.КартинкуВлево.Доступность 	= Ложь;	
		Элементы.КартинкуВправо.Доступность = Ложь;	
	Иначе
		омКартинкиНаКлиенте.ВывестиКартинку(Объект.Ссылка, НомерКартинки, ЭтаФорма, ВсегоКартинок);
	КонецЕсли;

КонецПроцедуры // ВывестиКартинку()

#КонецОбласти

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Элементы.ВариантыПечати.СписокВыбора.ЗагрузитьЗначения(Справочники.Образцы.ПолучитьМассивВариантыНастроек());
	
	Если Элементы.ВариантыПечати.СписокВыбора.Количество() > 0 Тогда
	
		ВариантыПечати = Элементы.ВариантыПечати.СписокВыбора[0];	
	
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ГруппаКартинки.Видимость 				= Ложь;
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Истина;
	Иначе
		Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
		ЗаполнитьКомплекты();
	КонецЕсли;
	
	омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки);
	
	Если РольДоступна("Программист") Тогда
		СоздадьКомандуШильдикИКнопку(Элементы.НастройкиКартинки, "Шильдик", "Шильдик"); 
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздадьКомандуШильдикИКнопку(ЭлементГруппа, Заголовок, ИмяКоманды)
	
	КомандаДобавитьКартинка 			= ЭтаФорма.Команды.Добавить(ИмяКоманды);
	КомандаДобавитьКартинка.Заголовок 	= Заголовок;
	КомандаДобавитьКартинка.Действие 	= ИмяКоманды;
	
	КнопкаДобавитьНастройка 			= Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьНастройка.Заголовок 	= Заголовок;
	КнопкаДобавитьНастройка.ИмяКоманды 	= ИмяКоманды;
	КнопкаДобавитьНастройка.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	КнопкаДобавитьНастройка.Картинка	= БиблиотекаКартинок.Настройка;
	
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Комплекты1ПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ЗаполнитьКомплекты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзделияКомплектОбразцы.Ссылка КАК Ссылка,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Образец = &Образец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.УстановитьПараметр("Образец", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Комплекты.Добавить(Выборка.Ссылка, Выборка.Наименование);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

#Область Картинки
	НастройкиКартинки 			= Неопределено;
	МассивИменВременныхФайлов 	= Новый Массив;
	ВывестиКартинку();
#КонецОбласти

	Элементы.ФормаПечатьШильдика.Доступность 	= ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.НастройкиКартинки.Доступность		= Элементы.ФормаПечатьШильдика.Доступность;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменилииКартинкиОбъектТЗ" И Параметр.ОбъектТЗ = Объект.Ссылка Тогда
		
		ВывестиКартинку();
		
	Иначе
	
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ГруппаКартинки.Видимость 				= Истина;
	Элементы.ДекорацияНеобходимоЗаписать.Видимость 	= Ложь;
	Элементы.ФормаПечатьШильдика.Доступность 		= Истина;
	Элементы.НастройкиКартинки.Доступность			= Истина;
КонецПроцедуры

&НаКлиенте
Процедура Шильдик(Команда)
	Если Модифицированность Тогда
	   	ПоказатьПредупреждение(, "Перед печатью шильдика необходимо сохранить образец.");
	Иначе	
		ОткрытьФорму("Справочник.Образцы.Форма.ФормаШильдик", Новый Структура("Образец", Объект.Ссылка), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьШильдика(Команда)
	
	ИдентификаторПечатнойФормы = "ШилдикОбразца";
	НазваниеПечатнойФормы = НСтр("ru = 'Шильдик образца'");
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета 		= НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент 	= ПолучитьФормуШильдик(Объект.Ссылка, ВариантыПечати);
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьФормуШильдик(Образец, ИмяВарианта)
	
	Пример = Новый ТабличныйДокумент;
	
	ДанныеОбразца = Справочники.Образцы.ПолучитьДанныеОбразца(Образец);
	
	СтркутураНастроекПечати 					= Справочники.Образцы.ПолучитьВариантНастройки(ИмяВарианта);
	СтркутураНастроекПечати.ТекстНаименование	= ДанныеОбразца.Наименование;
	Справочники.Образцы.СформироватьТаблицуНаСервере(Образец, СтркутураНастроекПечати, Пример);

   	Возврат Пример;
	
КонецФункции // ПолучитьФормуШильдик()
